yxj777/StudyNotes/STM32/STM32F103C8T6/练习/Project/5-1 EXIT/Hardware/Led.c
#include "stm32f10x.h"                  

void LED_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_0 | GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	GPIO_SetBits(GPIOA,GPIO_Pin_0 | GPIO_Pin_1);
	
}
void LED1_ON(void)
{
	GPIO_ResetBits(GPIOA,GPIO_Pin_0);
}
void LED1_OFF(void)
{
	GPIO_SetBits(GPIOA,GPIO_Pin_0);
}
void LED2_ON(void)
{
	GPIO_ResetBits(GPIOA,GPIO_Pin_1);
}
void LED2_OFF(void)
{
	GPIO_SetBits(GPIOA,GPIO_Pin_1);
}
void LED1_Turn(void)
{
	if(GPIO_ReadOutputDataBit(GPIOA,GPIO_Pin_0))
		GPIO_ResetBits(GPIOA,GPIO_Pin_0);
	else
		GPIO_SetBits(GPIOA,GPIO_Pin_0);		
}
void LED2_Turn(void)
{
	if(GPIO_ReadOutputDataBit(GPIOA,GPIO_Pin_1))
		GPIO_ResetBits(GPIOA,GPIO_Pin_1);
	else
		GPIO_SetBits(GPIOA,GPIO_Pin_1);		
}
